; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	image0 - mode
	spectrograph3 - mode
	thermograph2 - mode
	thermograph1 - mode
	Star3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Planet23 - direction
	Phenomenon24 - direction
	Phenomenon25 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet18)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet19)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star4)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument5 spectrograph3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star0)
	(supports instrument7 thermograph2)
	(supports instrument7 spectrograph3)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon17)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star2)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(pointing satellite0 Phenomenon12)
	(pointing satellite2 Phenomenon13)
	(pointing satellite4 Planet20)
	(have_image Phenomenon5 thermograph1)
	(have_image Star6 thermograph1)
	(have_image Star7 spectrograph3)
	(have_image Phenomenon8 image0)
	(have_image Phenomenon9 image0)
	(have_image Star10 spectrograph3)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 thermograph2)
	(have_image Phenomenon15 thermograph1)
	(have_image Planet16 thermograph2)
	(have_image Phenomenon17 thermograph1)
	(have_image Planet18 thermograph1)
	(have_image Planet19 thermograph1)
	(have_image Phenomenon21 image0)
	(have_image Planet22 spectrograph3)
	(have_image Planet23 thermograph2)
	(have_image Phenomenon24 thermograph2)
	(have_image Phenomenon25 thermograph2)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 23
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 23
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 23
4. (turn_to satellite4 planet20 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet20)
   goals met: 1 of 23
5. (turn_to satellite4 star2 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 star2)
   goals met: 0 of 23
6. (calibrate satellite4 instrument8 star2)
   added: (calibrated instrument8)
   goals met: 0 of 23
7. (turn_to satellite4 phenomenon13 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 23
8. (take_image satellite4 phenomenon13 instrument8 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 1 of 23
9. (turn_to satellite4 phenomenon15 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon15)
   goals met: 1 of 23
10. (take_image satellite4 phenomenon15 instrument8 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 2 of 23
11. (turn_to satellite4 phenomenon17 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon17)
   goals met: 2 of 23
12. (take_image satellite4 phenomenon17 instrument8 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 3 of 23
13. (turn_to satellite4 phenomenon5 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon5)
   goals met: 3 of 23
14. (take_image satellite4 phenomenon5 instrument8 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 4 of 23
15. (turn_to satellite4 planet18 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 planet18)
   goals met: 4 of 23
16. (take_image satellite4 planet18 instrument8 thermograph1)
   added: (have_image planet18 thermograph1)
   goals met: 5 of 23
17. (turn_to satellite4 planet19 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 planet19)
   goals met: 5 of 23
18. (take_image satellite4 planet19 instrument8 thermograph1)
   added: (have_image planet19 thermograph1)
   goals met: 6 of 23
19. (turn_to satellite4 planet20 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet20)
   goals met: 7 of 23
20. (turn_to satellite2 phenomenon13 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon13)
   goals met: 8 of 23
21. (turn_to satellite2 star2 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 star2)
   goals met: 7 of 23
22. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 7 of 23
23. (turn_to satellite2 phenomenon12 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon12)
   goals met: 7 of 23
24. (take_image satellite2 phenomenon12 instrument4 image0)
   added: (have_image phenomenon12 image0)
   goals met: 8 of 23
25. (turn_to satellite2 phenomenon13 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon13)
   goals met: 9 of 23
26. (turn_to satellite0 groundstation1 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 groundstation1)
   goals met: 9 of 23
27. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 9 of 23
28. (turn_to satellite0 phenomenon12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon12)
   goals met: 10 of 23
29. (turn_to satellite4 star6 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 star6)
   goals met: 9 of 23
30. (take_image satellite4 star6 instrument8 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 10 of 23
31. (turn_to satellite4 planet20 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 planet20)
   goals met: 11 of 23
32. (turn_to satellite2 phenomenon14 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon14)
   goals met: 10 of 23
33. (take_image satellite2 phenomenon14 instrument4 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 11 of 23
34. (turn_to satellite2 phenomenon13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon13)
   goals met: 12 of 23
35. (turn_to satellite2 phenomenon21 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon21)
   goals met: 11 of 23
36. (take_image satellite2 phenomenon21 instrument4 image0)
   added: (have_image phenomenon21 image0)
   goals met: 12 of 23
37. (turn_to satellite2 phenomenon13 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 phenomenon13)
   goals met: 13 of 23
38. (turn_to satellite2 phenomenon24 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon24)
   goals met: 12 of 23
39. (take_image satellite2 phenomenon24 instrument4 thermograph2)
   added: (have_image phenomenon24 thermograph2)
   goals met: 13 of 23
40. (turn_to satellite2 phenomenon13 phenomenon24)
   deleted: (pointing satellite2 phenomenon24)
   added: (pointing satellite2 phenomenon13)
   goals met: 14 of 23
41. (turn_to satellite2 phenomenon25 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon25)
   goals met: 13 of 23
42. (take_image satellite2 phenomenon25 instrument4 thermograph2)
   added: (have_image phenomenon25 thermograph2)
   goals met: 14 of 23
43. (turn_to satellite2 phenomenon13 phenomenon25)
   deleted: (pointing satellite2 phenomenon25)
   added: (pointing satellite2 phenomenon13)
   goals met: 15 of 23
44. (turn_to satellite2 phenomenon8 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon8)
   goals met: 14 of 23
45. (take_image satellite2 phenomenon8 instrument4 image0)
   added: (have_image phenomenon8 image0)
   goals met: 15 of 23
46. (turn_to satellite2 phenomenon13 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon13)
   goals met: 16 of 23
47. (turn_to satellite2 phenomenon9 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon9)
   goals met: 15 of 23
48. (take_image satellite2 phenomenon9 instrument4 image0)
   added: (have_image phenomenon9 image0)
   goals met: 16 of 23
49. (turn_to satellite2 phenomenon13 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon13)
   goals met: 17 of 23
50. (turn_to satellite2 planet11 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet11)
   goals met: 16 of 23
51. (take_image satellite2 planet11 instrument4 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 17 of 23
52. (turn_to satellite2 phenomenon13 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon13)
   goals met: 18 of 23
53. (turn_to satellite2 planet16 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet16)
   goals met: 17 of 23
54. (take_image satellite2 planet16 instrument4 thermograph2)
   added: (have_image planet16 thermograph2)
   goals met: 18 of 23
55. (turn_to satellite2 phenomenon13 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 phenomenon13)
   goals met: 19 of 23
56. (turn_to satellite2 planet23 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet23)
   goals met: 18 of 23
57. (take_image satellite2 planet23 instrument4 thermograph2)
   added: (have_image planet23 thermograph2)
   goals met: 19 of 23
58. (turn_to satellite2 phenomenon13 planet23)
   deleted: (pointing satellite2 planet23)
   added: (pointing satellite2 phenomenon13)
   goals met: 20 of 23
59. (turn_to satellite0 planet22 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet22)
   goals met: 19 of 23
60. (take_image satellite0 planet22 instrument0 spectrograph3)
   added: (have_image planet22 spectrograph3)
   goals met: 20 of 23
61. (turn_to satellite0 phenomenon12 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 phenomenon12)
   goals met: 21 of 23
62. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 20 of 23
63. (take_image satellite0 star10 instrument0 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 21 of 23
64. (turn_to satellite0 phenomenon12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon12)
   goals met: 22 of 23
65. (turn_to satellite0 star7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star7)
   goals met: 21 of 23
66. (take_image satellite0 star7 instrument0 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 22 of 23
67. (turn_to satellite0 phenomenon12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon12)
   goals met: 23 of 23
